# 1. Напишите программу, в которой программа запрашивает у пользователя
# день и месяц, а затем выводит сообщение о текущем дне и месяце.

currentDay = int(input('Введите текущий день: '))
currentMonth = input('Введите текущий месяц: ')

print(f'Текущий день -  {currentDay}\nТекущий месяц - {currentMonth}')
